In [1]:
a = 3
b = 4 
a + b

7

In [2]:
import pandas as pd
import numpy as np
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 90000]
}
df = pd.DataFrame(data)
df

# Creating a new column
df['Bonus'] = df['Salary'] * 0.1  # Create a new column 'Bonus' based on 'Salary'
df['Total_Salary'] = df['Salary'] + df['Bonus']  # Create another new column 'Total_Salary'
df
df['Designation'] = ['Manager', 'Developer', 'Analyst']  # Add a new column 'Designation'
df

      Name  Age         City  Salary   Bonus  Total_Salary Designation
0    Alice   25     New York   70000  7000.0       77000.0     Manager
1      Bob   30  Los Angeles   80000  8000.0       88000.0   Developer
2  Charlie   35      Chicago   90000  9000.0       99000.0     Analyst